// замыкание - это функция со всеми доступными ей переменными
// скоп - по месту описания функции
// лексическое окружение создается во время запуска

// -----------------------------------------------------------

// в ес 5 был вар. Он всплывает.
// // es5
// var x = 10;
// var x = 20;
// console.log(x);
// // es6
// let x = 10;
// let x = 20;
// console.log(x);

// // ES5
// X = 10;
// console.log(X);

// // es6
// 'use strict'
// x = 10;
// console.log(x);


// 'use strict'
// console.log(x);
// var x = 10;
// console.log(x);

// 'use strict'
// console.log(x);
// x = 10;
// console.log(x);


